In [1]:
# import necessary libraries
import pandas as pd

In [2]:
csv_data = pd.read_csv('csv_data.csv')
csv_data

   Name   Age               race
0  Tigi    24   african-american
1  Mobi    27              asian
2  Waga    32             latino

In [12]:
data = pd.read_excel('excel_data.xlsx')
data

   Students  Height Fav_color
0    Akwasi     184     Black
1  Franklin     175  Burgundy
2  Nashirat     178    Purple
3     Irene     188     Green

In [3]:
pro_est_df = pd.read_csv('PRODUCTION ESTIMATES.csv')
pro_est_df

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
0,WESTERN,SHAMA AHANTA EAST,2008,MAIZE,"1,099.00",1.15,"1,263.85"
1,WESTERN,WEST AHANTA,2008,MAIZE,"1,433.00",1.19,"1,705.27"
2,WESTERN,MPORHOR WASSA EAST,2008,MAIZE,"2,034.00",1.32,"2,684.88"
3,WESTERN,WASSA WEST,2008,MAIZE,"2,204.00",1.2,"2,644.80"
4,WESTERN,EAST NZEMA,2008,MAIZE,"1,550.00",1.38,"2,139.00"
...,...,...,...,...,...,...,...
8231,NORTHERN REGION,MAMPRUGU MOAGDURI,2017,CASSAVA,900,7.95,"7,155.00"
8232,NORTHERN REGION,YENDI,2017,CASSAVA,"4,790.00",13.59,"65,096.10"
8233,NORTHERN REGION,MION,2017,CASSAVA,"3,831.00",6.96,"26,663.76"
8234,NORTHERN REGION,TATALE SANGULI,2017,CASSAVA,"5,192.00",13.85,"71,909.20"
8235,NORTHERN REGION,ZABZUGU,2017,CASSAVA,"4,612.00",13.85,"63,876.20"

In [4]:
# ascertain the column types
pro_est_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8236 entries, 0 to 8235
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   REGION           8236 non-null   object
 1   DISTRICT         8236 non-null   object
 2   YEAR             8236 non-null   int64
 3   CROP             8236 non-null   object
 4   AREA (HA)        8236 non-null   object
 5   YIELD (MT/HA)    8220 non-null   object
 6   PRODUCTION (MT)  8234 non-null   object
dtypes: int64(1), object(6)
memory usage: 450.5+ KB

In [10]:
data = pd.read_excel('excel_data.xlsx')
data

   Students Height Fav_color
0    Akwasi    184     Black
1  Franklin    175  Burgundy
2  Nashirat    178    Purple
3     Irene    188     Green
4      Amma             Pink
5    Fauzia    Abc    Yellow

In [13]:
# count null values within each column
data.isnull().sum()

Students     0
Height       0
Fav_color    0
dtype: int64

In [15]:
pro_est_df.isnull().sum()

REGION              0
DISTRICT            0
YEAR                0
CROP                0
AREA (HA)           0
YIELD (MT/HA)      16
PRODUCTION (MT)     2
dtype: int64

In [16]:
pro_est_df.columns

Index(['REGION', 'DISTRICT', 'YEAR', 'CROP', 'AREA (HA)', 'YIELD (MT/HA)',
       'PRODUCTION (MT)'],
      dtype='object')

In [17]:
pro_est_df.REGION

0               WESTERN
1               WESTERN
2               WESTERN
3               WESTERN
4               WESTERN
             ...
8231    NORTHERN REGION
8232    NORTHERN REGION
8233    NORTHERN REGION
8234    NORTHERN REGION
8235    NORTHERN REGION
Name: REGION, Length: 8236, dtype: object

In [18]:
pro_est_df['REGION']

0               WESTERN
1               WESTERN
2               WESTERN
3               WESTERN
4               WESTERN
             ...
8231    NORTHERN REGION
8232    NORTHERN REGION
8233    NORTHERN REGION
8234    NORTHERN REGION
8235    NORTHERN REGION
Name: REGION, Length: 8236, dtype: object

In [20]:
pro_est_df['AREA (HA)']

0       1,099.00
1       1,433.00
2       2,034.00
3       2,204.00
4       1,550.00
          ...
8231         900
8232    4,790.00
8233    3,831.00
8234    5,192.00
8235    4,612.00
Name: AREA (HA), Length: 8236, dtype: object

In [22]:
# get rows and columns
rows_cols = pro_est_df.shape

In [23]:
type(rows_cols)

tuple

In [26]:
rows_cols[1]

7

In [27]:
# get first 5 rows
pro_est_df.head()

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
0,WESTERN,SHAMA AHANTA EAST,2008,MAIZE,"1,099.00",1.15,"1,263.85"
1,WESTERN,WEST AHANTA,2008,MAIZE,"1,433.00",1.19,"1,705.27"
2,WESTERN,MPORHOR WASSA EAST,2008,MAIZE,"2,034.00",1.32,"2,684.88"
3,WESTERN,WASSA WEST,2008,MAIZE,"2,204.00",1.2,"2,644.80"
4,WESTERN,EAST NZEMA,2008,MAIZE,"1,550.00",1.38,"2,139.00"

In [28]:
# get last 5 rows
pro_est_df.tail()

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
8231,NORTHERN REGION,MAMPRUGU MOAGDURI,2017,CASSAVA,900,7.95,"7,155.00"
8232,NORTHERN REGION,YENDI,2017,CASSAVA,"4,790.00",13.59,"65,096.10"
8233,NORTHERN REGION,MION,2017,CASSAVA,"3,831.00",6.96,"26,663.76"
8234,NORTHERN REGION,TATALE SANGULI,2017,CASSAVA,"5,192.00",13.85,"71,909.20"
8235,NORTHERN REGION,ZABZUGU,2017,CASSAVA,"4,612.00",13.85,"63,876.20"

In [31]:
# get first/last 13 rows
pro_est_df.tail(13)

,REGION,DISTRICT,YEAR,CROP,AREA (HA),YIELD (MT/HA),PRODUCTION (MT)
8223,NORTHERN REGION,SAWLA/TUNA/KALBA,2017,CASSAVA,"1,258.00",14.24,"17,913.92"
8224,NORTHERN REGION,TAMALE METRO,2017,CASSAVA,"1,567.32",6.96,"10,908.55"
8225,NORTHERN REGION,SAGNERIGU,2017,CASSAVA,346,6.96,"2,408.16"
8226,NORTHERN REGION,TOLON,2017,CASSAVA,"4,738.00",13.71,"64,957.98"
8227,NORTHERN REGION,KUMBUNGU,2017,CASSAVA,"1,000.00",9,"9,000.00"
8228,NORTHERN REGION,WEST GONJA,2017,CASSAVA,"14,100.00",25.6,"360,960.00"
8229,NORTHERN REGION,NORTH GONJA,2017,CASSAVA,850,13,"11,050.00"
8230,NORTHERN REGION,WEST MAMPRUSI,2017,CASSAVA,"1,100.00",5,"5,500.00"
8231,NORTHERN REGION,MAMPRUGU MOAGDURI,2017,CASSAVA,900,7.95,"7,155.00"
8232,NORTHERN REGION,YENDI,2017,CASSAVA,"4,790.00",13.59,"65,096.10"
8233,NORTHERN REGION,MION,2017,CASSAVA,"3,831.00",6.96,"26,663.76"
8234,NORTHERN REGION,TATALE SANGULI,2017,CASSAVA,"5,192.00",13.85,"71,909.20"
8235,NORTHERN REGION,ZABZUGU,2017,CASSAVA,"4,612.00",13.85,"63,876.20"

In [34]:
pro_est_df.columns

Index(['REGION', 'DISTRICT', 'YEAR', 'CROP', 'AREA (HA)', 'YIELD (MT/HA)',
       'PRODUCTION (MT)'],
      dtype='object')

In [35]:
# get fraction of all columns
pro_est_df[[ 'YEAR', 'AREA (HA)', 'YIELD (MT/HA)','PRODUCTION (MT)']]

      YEAR AREA (HA) YIELD (MT/HA) PRODUCTION (MT)
0     2008  1,099.00          1.15        1,263.85
1     2008  1,433.00          1.19        1,705.27
2     2008  2,034.00          1.32        2,684.88
3     2008  2,204.00           1.2        2,644.80
4     2008  1,550.00          1.38        2,139.00
...    ...       ...           ...             ...
8231  2017       900          7.95        7,155.00
8232  2017  4,790.00         13.59       65,096.10
8233  2017  3,831.00          6.96       26,663.76
8234  2017  5,192.00         13.85       71,909.20
8235  2017  4,612.00         13.85       63,876.20

[8236 rows x 4 columns]

In [36]:
# get descriptive statistics
pro_est_df.describe()

              YEAR
count  8236.000000
mean   2012.969888
std       2.864953
min    2008.000000
25%    2011.000000
50%    2013.000000
75%    2016.000000
max    2017.000000

In [46]:
data = pd.read_excel('excel_data.xlsx')
data

   Students  Height Fav_color  Salary()
0    Akwasi     184     Black     70000
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000
3     Irene     188     Green     70000
4      Amma     182      Pink     70000
5    Fauzia     186    Yellow     70000

In [47]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Students   6 non-null      object
 1   Height     6 non-null      int64
 2   Fav_color  6 non-null      object
 3   Salary()   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [48]:
data.describe()

           Height      Salary()
count    6.000000      6.000000
mean   182.166667  61666.666667
std      4.915960  20412.414523
min    175.000000  20000.000000
25%    179.000000  70000.000000
50%    183.000000  70000.000000
75%    185.500000  70000.000000
max    188.000000  70000.000000

In [50]:
data.Height.mean()

182.16666666666666

In [51]:
data.Height.min()

175

In [52]:
data.Height.max()

188

In [54]:
data.Height.mean()

182.16666666666666

In [53]:
data.Height.std()

4.915960401250875

In [55]:
# get a dataframe using a condition
data[data['Height'] > data.Height.mean() ]

  Students  Height Fav_color  Salary()
0   Akwasi     184     Black     70000
3    Irene     188     Green     70000
5   Fauzia     186    Yellow     70000

In [50]:
data.Height.mean()

182.16666666666666

In [56]:
data.columns

Index(['Students', 'Height', 'Fav_color', 'Salary()'], dtype='object')

In [63]:
data[(data['Height'] < 180) | (data['Salary()'] == 30000)]

   Students  Height Fav_color  Salary()
1  Franklin     175  Burgundy     20000
2  Nashirat     178    Purple     70000